W7D3/music_app/app/models/user.rb

    def reset_session_token!
        self.session_token = self.class.generate_session_token
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "hezLN3gXpYqzTcdiwqRYtQ"], ["updated_at", "2020-10-13 17:08:29.644709"], ["id", 1]]