W7D3/music_app/app/views/albums/new.html.erb

<select id='albumxband' name="album[band_id]">
    <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"